/********************************************************************************************************************
 * 암호화 모듈
 * - 암호화 키(key) 를 지정하지 않으면, .env 의 APP_KEY 를 기반으로 AES256 암호화를 수행
 * ******************************************************************************************************************/

import { encode as safeEncode, decode as safeDecode, trim as safeTrim } from 'url-safe-base64';
import aes256 from '../aes256';

const crypt = {
  /********************************************************************************************************************
   * 인코딩
   * ******************************************************************************************************************/
  enc(plainText: string, key?: string) {
    return safeTrim(safeEncode(aes256.encrypt(key || process.env.APP_KEY, plainText)));
  },

  /********************************************************************************************************************
   * 디코딩
   * ******************************************************************************************************************/
  dec(encryptedText: string, key?: string) {
    return aes256.decrypt(key || process.env.APP_KEY, safeDecode(encryptedText));
  },
};

export default crypt;
